jonsmirl/mpc5200/arch/arm/mach-lpc313x/include/mach/registers.h
/* SPI int_threshold registers definitions (SPI_INT_TRSH_REG) */
#define SPI_INT_TSHLD_TX(n)       _SBF(8, ((n) & 0xFF))
#define SPI_INT_TSHLD_RX(n)       ((n) & 0xFF)

/* SPI intterrupt registers definitions ( SPI_INT_xxx) */
#define SPI_SMS_INT               _BIT(4)
#define SPI_TX_INT                _BIT(3)
#define SPI_RX_INT                _BIT(2)
#define SPI_TO_INT                _BIT(1)
#define SPI_OVR_INT               _BIT(0)
#define SPI_ALL_INTS              (SPI_SMS_INT | SPI_TX_INT | SPI_RX_INT | SPI_TO_INT | SPI_OVR_INT)

/***********************************************************************
* Audio Subsystem (ADSS) register definitions
**********************************************************************/

/* I2S Controller Module Register Structure */
#define I2S_FORMAT_SETTINGS       __REG (I2S_PHYS + 0x00)
#define I2S_CFG_MUX_SETTINGS      __REG (I2S_PHYS + 0x04)
#define I2S_CLASSED_CFG           __REG (I2S_PHYS + 0x08)
#define I2S_CLASSED_STS           __REG (I2S_PHYS + 0x0C)
#define I2S_N_SOF_COUNTER         __REG (I2S_PHYS + 0x10)

/* I2S channels */
#define I2S_CH_TX0 1
#define I2S_CH_TX1 2
#define I2S_CH_RX0 3
#define I2S_CH_RX1 4

/* I2S channel specific registers */
#define I2S_CH_LEFT_16BIT(n)      __REG (I2S_PHYS + ((n) * 0x80) + 0x00)
#define I2S_CH_RIGHT_16BIT(n)     __REG (I2S_PHYS + ((n) * 0x80) + 0x04)
#define I2S_CH_LEFT_24BIT(n)      __REG (I2S_PHYS + ((n) * 0x80) + 0x08)
#define I2S_CH_RIGHT_24BIT(n)     __REG (I2S_PHYS + ((n) * 0x80) + 0x0C)
#define I2S_CH_INT_STATUS(n)      __REG (I2S_PHYS + ((n) * 0x80) + 0x10)
#define I2S_CH_INT_MASK(n)        __REG (I2S_PHYS + ((n) * 0x80) + 0x14)
#define I2S_CH_LEFT32(n)          __REG (I2S_PHYS + ((n) * 0x80) + 0x20)
#define I2S_CH_RIGHT32(n)         __REG (I2S_PHYS + ((n) * 0x80) + 0x40)
#define I2S_CH_INTERLEAVED(n)     __REG (I2S_PHYS + ((n) * 0x80) + 0x60)

/* I2S format settings register defines */
#define I2S_FORMAT_I2S            0x3
#define I2S_FORMAT_LSB16          0x4
#define I2S_FORMAT_LSB18          0x5
#define I2S_FORMAT_LSB20          0x6
#define I2S_FORMAT_LSB24          0x7
#define I2S_FORMAT_MASK           0x7
#define I2S_SET_FORMAT(n, s)      ((s) << (((n) - 1) * 3))

/* I2S Mux configuration setting defines */
#define I2S_RXO_SELECT_MASTER     _BIT(1)
#define I2S_RX1_SELECT_MASTER     _BIT(2)

/* I2S interrupt status and mask bits */
#define I2S_FIFO_RIGHT_UNDERRUN   _BIT(0)
#define I2S_FIFO_LEFT_UNDERRUN    _BIT(1)
#define I2S_FIFO_RIGHT_OVERRUN    _BIT(2)
#define I2S_FIFO_LEFT_OVERRUN     _BIT(3)
#define I2S_FIFO_LEFT_FULL        _BIT(4)
#define I2S_FIFO_LEFT_HALF_FULL   _BIT(5) /* RX only */
#define I2S_FIFO_LEFT_HALF_EMPTY  _BIT(5) /* TX only */
#define I2S_FIFO_LEFT_NOT_EMPTY   _BIT(6) /* RX only */
#define I2S_FIFO_LEFT_EMPTY       _BIT(6) /* TX only */
#define I2S_FIFO_RIGHT_FULL       _BIT(7)
#define I2S_FIFO_RIGHT_HALF_FULL  _BIT(8) /* RX only */
#define I2S_FIFO_RIGHT_HALF_EMPTY _BIT(8) /* TX only */
#define I2S_FIFO_RIGHT_NOT_EMPTY  _BIT(9) /* RX only */
#define I2S_FIFO_RIGHT_EMPTY      _BIT(9) /* TX only */
#define I2S_FIFO_ALL_MASK         0x3FF

/***********************************************************************
 * ADC_REG register definitions
 **********************************************************************/
#define ADC_CON_REG            __REG (ADC_PHYS + 0x20)

/***********************************************************************
 * SYS_REG register definitions
 **********************************************************************/
#define SYS_RNG_OSC_CFG        __REG (SYS_PHYS + 0x14)
#define SYS_ADC_PD             __REG (SYS_PHYS + 0x18)
#define SYS_SDMMC_DELAYMODES   __REG (SYS_PHYS + 0x2C)
#define SYS_USB_ATX_PLL_PD_REG __REG (SYS_PHYS + 0x30)
#define SYS_USB_OTG_CFG        __REG (SYS_PHYS + 0x34)
#define SYS_USB_OTG_LED_CTL    __REG (SYS_PHYS + 0x38)
#define SYS_USB_PLL_NDEC       __REG (SYS_PHYS + 0x40)
#define SYS_USB_PLL_MDEC       __REG (SYS_PHYS + 0x44)
#define SYS_USB_PLL_PDEC       __REG (SYS_PHYS + 0x48)
#define SYS_USB_PLL_SELR       __REG (SYS_PHYS + 0x4C)
#define SYS_USB_PLL_SELI       __REG (SYS_PHYS + 0x50)
#define SYS_USB_PLL_SELP       __REG (SYS_PHYS + 0x54)

#define SYS_MPMC_DELAY      __REG (SYS_PHYS + 0x68)
#define SYS_MPMC_WTD_DEL0   __REG (SYS_PHYS + 0x6C)
#define SYS_MPMC_WTD_DEL1   __REG (SYS_PHYS + 0x70)
#define SYS_MPMC_TESTMODE0  __REG (SYS_PHYS + 0x78)
#define SYS_REMAP_ADDR      __REG (SYS_PHYS + 0x84)
#define SYS_MUX_LCD_EBI     __REG (SYS_PHYS + 0x90)
#define SYS_MUX_GPIO_MCI    __REG (SYS_PHYS + 0x94)
#define SYS_MUX_NAND_MCI    __REG (SYS_PHYS + 0x98)

/***********************************************************************
 * GPIO register definitions
 **********************************************************************/
#define GPIO_STATE(port)     __REG (GPIO_PHYS + (port) + 0x00)
#define GPIO_STATE_M0(port)  __REG (GPIO_PHYS + (port) + 0x10)
#define GPIO_M0_SET(port)    __REG (GPIO_PHYS + (port) + 0x14)
#define GPIO_M0_RESET(port)  __REG (GPIO_PHYS + (port) + 0x18)
#define GPIO_STATE_M1(port)  __REG (GPIO_PHYS + (port) + 0x20)
#define GPIO_M1_SET(port)    __REG (GPIO_PHYS + (port) + 0x24)
#define GPIO_M1_RESET(port)  __REG (GPIO_PHYS + (port) + 0x28)

#define GPIO_OUT_LOW(port, pin)  do { GPIO_M1_SET(port) = pin; GPIO_M0_RESET(port) = pin;} while(0)
#define GPIO_OUT_HIGH(port, pin) do { GPIO_M1_SET(port) = pin; GPIO_M0_SET(port) = pin;} while(0)
#define GPIO_IN(port, pin)       do { GPIO_M1_RESET(port) = pin; GPIO_M0_RESET(port) = pin;} while(0)
#define GPIO_DRV_IP(port, pin)   do { GPIO_M1_RESET(port) = pin; GPIO_M0_SET(port) = pin;} while(0)

#define IOCONF_EBI_MCI       (0x000)
#define IOCONF_EBI_I2STX_0   (0x040)
#define IOCONF_CGU           (0x080)
#define IOCONF_I2SRX_0       (0x0c0)
#define IOCONF_I2SRX_1       (0x100)
#define IOCONF_I2STX_1       (0x140)
#define IOCONF_EBI           (0x180)
#define IOCONF_GPIO          (0x1c0)
#define IOCONF_I2C1          (0x200)
#define IOCONF_SPI           (0x240)
#define IOCONF_NAND_CTRL     (0x280)
#define IOCONF_PWM           (0x2c0)
#define IOCONF_UART          (0x300)


/***********************************************************************
 * MPMC memory controller register definitions
 **********************************************************************/
#define MPMC_CTRL           __REG (MPMC_PHYS + 0x000)
#define MPMC_STATUS         __REG (MPMC_PHYS + 0x004)
#define MPMC_CONFIG         __REG (MPMC_PHYS + 0x008)
#define MPMC_DYNCTL         __REG (MPMC_PHYS + 0x020)
#define MPMC_DYNREF         __REG (MPMC_PHYS + 0x024)
#define MPMC_DYRDCFG        __REG (MPMC_PHYS + 0x028)
#define MPMC_DYTRP          __REG (MPMC_PHYS + 0x030)
#define MPMC_DYTRAS         __REG (MPMC_PHYS + 0x034)
#define MPMC_DYTSREX        __REG (MPMC_PHYS + 0x038)
#define MPMC_DYTAPR         __REG (MPMC_PHYS + 0x03C)
#define MPMC_DYTDAL         __REG (MPMC_PHYS + 0x040)
#define MPMC_DYTWR          __REG (MPMC_PHYS + 0x044)
#define MPMC_DYTRC          __REG (MPMC_PHYS + 0x048)
#define MPMC_DYTRFC         __REG (MPMC_PHYS + 0x04C)
#define MPMC_DYTXSR         __REG (MPMC_PHYS + 0x050)
#define MPMC_DYTRRD         __REG (MPMC_PHYS + 0x054)
#define MPMC_DYTMRD         __REG (MPMC_PHYS + 0x058)
#define MPMC_STEXDWT        __REG (MPMC_PHYS + 0x080)
#define MPMC_DYCONFIG       __REG (MPMC_PHYS + 0x100)
#define MPMC_DYRASCAS       __REG (MPMC_PHYS + 0x104)
#define MPMC_STCONFIG0      __REG (MPMC_PHYS + 0x200)
#define MPMC_STWTWEN0       __REG (MPMC_PHYS + 0x204)
#define MPMC_STWTOEN0       __REG (MPMC_PHYS + 0x208)
#define MPMC_STWTRD0        __REG (MPMC_PHYS + 0x20C)
#define MPMC_STWTPG0        __REG (MPMC_PHYS + 0x210)
#define MPMC_STWTWR0        __REG (MPMC_PHYS + 0x214)
#define MPMC_STWTTURN0      __REG (MPMC_PHYS + 0x218)
#define MPMC_STCONFIG1      __REG (MPMC_PHYS + 0x220)
#define MPMC_STWTWEN1       __REG (MPMC_PHYS + 0x224)
#define MPMC_STWTOEN1       __REG (MPMC_PHYS + 0x228)
#define MPMC_STWTRD1        __REG (MPMC_PHYS + 0x22C)
#define MPMC_STWTPG1        __REG (MPMC_PHYS + 0x230)
#define MPMC_STWTWR1        __REG (MPMC_PHYS + 0x234)
#define MPMC_STWTTURN1      __REG (MPMC_PHYS + 0x238)

